# 0317

Related links

- [Course website](https://www-math.nsysu.edu.tw/~chlin/2025SMath599/2025SMath599.html)
- [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/)

## Data

In [1]:
### load nsysu

import os
import urllib
import numpy as np

base = r"https://github.com/SageLabTW/auto-grading/raw/master/nsysu-digits/"
for c in ['X', 'y']:
    filename = "nsysu-digits-%s.csv"%c
    if filename not in os.listdir('.'):
        print(filename, 'not found --- will download')
        urllib.request.urlretrieve(base + c + ".csv", filename)

Xsys = np.genfromtxt('nsysu-digits-X.csv', dtype=int, delimiter=',') ### flattened already
ysys = np.genfromtxt('nsysu-digits-y.csv', dtype=int, delimiter=',')

In [2]:
# load MNIST (long)

from sklearn.datasets import fetch_openml
mnist = fetch_openml('mnist_784')

[Sample DataFrame](https://docs.google.com/spreadsheets/d/1pzcuTVMyRhBrwmcpOnGILUjMsPeF8fjkSSLwUuevXJ0/edit?usp=sharing)

In [3]:
from sklearn import datasets
titanic = datasets.fetch_openml(name='titanic', version=1, as_frame=True)

In [4]:
# required packages
import numpy as np
import pandas as pd

## [Hierarchical Indexing](https://jakevdp.github.io/PythonDataScienceHandbook/03.05-hierarchical-indexing.html)

tuple vs MultiIndex

In [5]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index, name="population")
print(pop[("Texas", 2010)])
pop

25145561

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
Name: population, dtype: int64

In [6]:
# pd.MultiIndex.from_tuples (set names)
index = pd.MultiIndex.from_tuples(index, names=["state", "year"])
print("By state\n", pop.reindex(index)["California"])
print("By year\n", pop.reindex(index)[:,2000])
pop.reindex(index)

By state
 year
2000    33871648
2010    37253956
Name: population, dtype: int64
By year
 state
California    33871648
New York      18976457
Texas         20851820
Name: population, dtype: int64

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
Name: population, dtype: int64

In [7]:
# pd.MultiIndex.from_arrays (set names)
state = ["California", "California", "New York", "New York", "Texas", "Texas", "Texas"]
year = [2000, 2010, 2000, 2010, 2000, 2010, 2020]
pd.MultiIndex.from_arrays([state, year])

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010),
            (     'Texas', 2020)],
           )

In [8]:
# pd.MultiIndex.from_product (set names)
state = ["California", "New York", "Texas"]
year = [2000, 2010]
pd.MultiIndex.from_product([state, year])

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

stack and unstack

In [9]:
pop = pop.reindex(index)

In [10]:
# unstack
pop.unstack()

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [11]:
# stack
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [34]:
index = [(major, grade, gender)
         for major in ["CS", "MATH", "MIS"]
         for grade in [1,2,3,4]
         for gender in ["male", "female"]
        ]
num = pd.Series(50, name="number", 
                index=pd.MultiIndex.from_tuples(index, names=["major", "grade", "gender"]))
num += np.random.randint(-10, 10, num.shape)

In [35]:
num

major  grade  gender
CS     1      male      55
              female    40
       2      male      57
              female    44
       3      male      53
              female    45
       4      male      43
              female    48
MATH   1      male      55
              female    53
       2      male      44
              female    49
       3      male      44
              female    59
       4      male      50
              female    40
MIS    1      male      49
              female    52
       2      male      49
              female    53
       3      male      57
              female    53
       4      male      53
              female    45
Name: number, dtype: int64

In [14]:
num.unstack()

gender       female  male
major grade
CS    1          55    50
      2          51    43
      3          42    58
      4          56    52
MATH  1          46    53
      2          40    46
      3          44    49
      4          55    53
MIS   1          53    53
      2          42    46
      3          53    56
      4          55    48

In [39]:
num.unstack(level=1).sum(axis=1)

major  gender
CS     female    177
       male      208
MATH   female    201
       male      193
MIS    female    203
       male      208
dtype: int64

reset_index and set_index

In [16]:
df = num.reset_index()
df

   major  grade  gender  number
0     CS      1    male      50
1     CS      1  female      55
2     CS      2    male      43
3     CS      2  female      51
4     CS      3    male      58
5     CS      3  female      42
6     CS      4    male      52
7     CS      4  female      56
8   MATH      1    male      53
9   MATH      1  female      46
10  MATH      2    male      46
11  MATH      2  female      40
12  MATH      3    male      49
13  MATH      3  female      44
14  MATH      4    male      53
15  MATH      4  female      55
16   MIS      1    male      53
17   MIS      1  female      53
18   MIS      2    male      46
19   MIS      2  female      42
20   MIS      3    male      56
21   MIS      3  female      53
22   MIS      4    male      48
23   MIS      4  female      55

In [17]:
df.set_index(["major","gender","grade"]).unstack()

             number
grade             1   2   3   4
major gender
CS    female     55  51  42  56
      male       50  43  58  52
MATH  female     46  40  44  55
      male       53  46  49  53
MIS   female     53  42  53  55
      male       53  46  56  48

## [Combining Datasets: Concat and Append](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html)

Purpose: adding **samples**

NumPy concatenate

In [51]:
# np.concatenate
a = np.array([1,2,3])
b = np.array([4,5,6])
np.concatenate([a,b])

array([1, 2, 3, 4, 5, 6])

In [ ]:
# np.hstack

In [20]:
# np.vstack

pandas concatenate

- DataFrame by default concat data by adding rows
- Use `axis` to change the direction of concat
- Use `verify_integrity` or `ignore_index` to handle duplicated index
- Set `join` as `"inner"` or `"outer"` to decide which samples to be included
- `a.append(b)` ~ `pd.concat([a, b'])`

In [21]:
# see textbook examples

## [Combining Datasets: Merge and Join](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html)

Purpose: Merging **features**

pd.merge

- `pd.merge(a,b)` ~ `pd.concat([a,b], axis=1)`
- one-to-one, many-to-one, one-to-many, many-to-many
- `on`, `left_on`, and `right_on`
- To merge on index, use `left_index` or `right_index`
- `pd.join` is a shorthand for merging on two indices
- Set `how` as `"inner"`, `"outer"`, `"left"`, `"right"` to decide which samples to be included

Read [Example: US States Data](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html#Example:-US-States-Data)

## [Aggregation and Grouping](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html)

Purpose: Extracting information

In [22]:
X,y = titanic.data, titanic.target
y = y.astype(int)
X["survive"] = y

In [23]:
X.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survive
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0

In [129]:
# total survival rate
X.survive.mean()

np.float64(0.3819709702062643)

GroupBy: Split, Apply, Combine

![](https://jakevdp.github.io/PythonDataScienceHandbook/figures/03.08-split-apply-combine.png)

In [25]:
# check survival rate by groupby

In [26]:
# try it step-by-step

In [27]:
# select groupby column

In [28]:
# choose apply as  describe

GroupBy with aggregate, filter, transform, apply

In [29]:
# see textbook examples

Read [Grouping example](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html#Grouping-example)

## Homework

- Type your answers here and submit your answer in `*.ipynb` format.
- You may use code cell and Markdown cell.

In [1]:
NAME = "李瑋宸" # change to your name
STD_ID = "B123245008" # change to your student ID
print("My name is %s and my student ID is %s."%(NAME, STD_ID))

My name is 李瑋宸 and my student ID is B123245008.

### Exercise 1: Creating a MultiIndex DataFrame
Create a DataFrame with hierarchical indexing using the following data:

```python
import pandas as pd

arrays = [['A', 'A', 'B', 'B'], [1, 2, 1, 2]]
index = pd.MultiIndex.from_arrays(arrays, names=('Group', 'ID'))
data = {'Value': [10, 20, 30, 40]}
df = pd.DataFrame(data, index=index)
print(df)
```

Interpret the output and explain how to access the value `30`.

In [13]:
import pandas as pd

arrays = [['A', 'A', 'B', 'B'], [1, 2, 1, 2]]
index = pd.MultiIndex.from_arrays(arrays, names=('Group', 'ID'))
data = {'Value': [10, 20, 30, 40]}
df = pd.DataFrame(data, index=index)
print(df,"\n\n")

print(df.loc[('B',1)])

print(df[df["Value"]==30])
#將"Value"為30取出

          Value
Group ID
A     1      10
      2      20
B     1      30
      2      40


Value    30
Name: (B, 1), dtype: int64
          Value
Group ID
B     1      30

### Exercise 2: Swapping and Sorting Levels
Using the DataFrame from Exercise 1, swap the index levels and then sort the DataFrame based on the new index order.

In [14]:

df = df.reset_index()
df = df.set_index(["ID","Group"])
print(df)
df=df.sort_index()
print(df)

          Value
ID Group
1  A         10
2  A         20
1  B         30
2  B         40
          Value
ID Group
1  A         10
   B         30
2  A         20
   B         40

### Exercise 3: Indexing with Hierarchical Data
Using the DataFrame from Exercise 1, retrieve all values where `Group` is `'A'`.

In [15]:
index = pd.MultiIndex.from_arrays(arrays, names=('Group', 'ID'))
data = {'Value': [10, 20, 30, 40]}
df = pd.DataFrame(data, index=index)
print(df.loc["A"])
print(df.xs('A',level="Group"))
print(df.query("Group == 'A'"))

    Value
ID
1      10
2      20
    Value
ID
1      10
2      20
          Value
Group ID
A     1      10
      2      20

### Exercise 4: Concatenating DataFrames
Create two DataFrames:

```python
df1 = pd.DataFrame({'A': ['a0', 'a1'], 'B': ['b0', 'b1']})
df2 = pd.DataFrame({'A': ['a2', 'a3'], 'B': ['b2', 'b3']})
```

Concatenate them along the rows.

In [16]:
df1 = pd.DataFrame({'A': ['a0', 'a1'], 'B': ['b0', 'b1']})
df2 = pd.DataFrame({'A': ['a2', 'a3'], 'B': ['b2', 'b3']})
df = pd.concat([df1,df2])
print(df)

    A   B
0  a0  b0
1  a1  b1
0  a2  b2
1  a3  b3

### Exercise 5: Appending DataFrames
Using the DataFrames from Exercise 4, append `df2` to `df1` and reset the index.

In [17]:
df = pd.concat([df1,df2],ignore_index=True)
print(df)

    A   B
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3

### Exercise 6: Merging DataFrames
Create two DataFrames:

```python
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]})
```

Perform an inner merge on the `ID` column.

In [18]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]})
pd.merge(df1,df2,on = "ID",how = "inner")

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90

### Exercise 7: Using Different Merge Types
Using the DataFrames from Exercise 6, perform:
- A left merge
- A right merge
- An outer merge

Compare the outputs and explain the differences.

In [19]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]})
df = pd.merge(df1,df2,how = "left")
print(df)
df = pd.merge(df1,df2,how = "right")
print(df)
df = pd.merge(df1,df2,how = "outer")
print(df)

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0
   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90
2   4      NaN     95
   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0
3   4      NaN   95.0

### Exercise 8: Grouping Data
Given the following DataFrame:

```python
data = {'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
        'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'Salary': [50000, 55000, 60000, 65000, 70000]}
df = pd.DataFrame(data)
```

Group by the `Department` column and compute the mean salary for each department.

In [20]:
data = {'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
        'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'Salary': [50000, 55000, 60000, 65000, 70000]}
df = pd.DataFrame(data)
print(df)

df = df.groupby("Department")
print(df["Salary"].mean())

  Department Employee  Salary
0         HR    Alice   50000
1         HR      Bob   55000
2         IT  Charlie   60000
3         IT    David   65000
4    Finance      Eve   70000
Department
Finance    70000.0
HR         52500.0
IT         62500.0
Name: Salary, dtype: float64

### Exercise 9: Applying Multiple Aggregations
Using the DataFrame from Exercise 8, apply multiple aggregations (`mean` and `max`) on the `Salary` column.

In [21]:
data = {'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
        'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'Salary': [50000, 55000, 60000, 65000, 70000]}
df = pd.DataFrame(data)
df.agg({"Salary" : ['mean','max']})

       Salary
mean  60000.0
max   70000.0

### Exercise 10: Custom Aggregation Function
Define a custom aggregation function that calculates the range (max - min) of salaries within each department in the DataFrame from Exercise 8. Apply this function using `.agg()`.

In [22]:
def range_func(x):
    return x.max()-x.min()

df = pd.DataFrame(data)
df = df.groupby("Department")
df.agg({"Salary" : [range_func]})

               Salary
           range_func
Department
Finance             0
HR               5000
IT               5000